harness/cf/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

harness/cf/HTTPServices/ОбменСкладом/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// HTTP-сервис ОбменСкладом.
// DEFECT: ОстаткиGET не фильтрует по складу (задача cfe-http-filter-01).
////////////////////////////////////////////////////////////////////////////////

Функция ОстаткиGET(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	// TODO(live): читать query-параметр "склад" и отбирать ОстаткиТоваров по Склад.
	ЗапросОстатков = Новый Запрос;
	ЗапросОстатков.Текст =
	"ВЫБРАТЬ
	|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровОстатки.Склад КАК Склад,
	|	ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки";

	Результат = ЗапросОстатков.Выполнить().Выгрузить();
	Ответ.УстановитьТелоИзСтроки(СформироватьJSONОстатков(Результат));
	Возврат Ответ;

КонецФункции

Функция СформироватьJSONОстатков(ТаблицаОстатков)

	// Упрощённая сериализация для фикстуры.
	Части = Новый Массив;
	Для Каждого Строка Из ТаблицаОстатков Цикл
		Части.Добавить(СтрШаблон(
			"{""nomenclature"":""%1"",""warehouse"":""%2"",""qty"":%3}",
			Строка(Строка.Номенклатура),
			Строка(Строка.Склад),
			Формат(Строка.Количество, "ЧГ=0")));
	КонецЦикла;
	Возврат "[" + СтрСоединить(Части, ",") + "]";

КонецФункции
